# -*- coding: utf8 -*-
from audioop import reverse
import datetime
import random
from transliterate import slugify

def gen_address():
    return f'г. {random.choice(["Москва", "Химки", "Мытищи", "Люберцы"])}, ' + \
            f'ул. {random.choice(["Ленина", "Маркса", "Энгельса", "Сталина", "Ульянова"])}, ' + \
            f'д. {random.randint(1, 100)}'

names = ["Щукина Наталия Мэлоровна",  "Мухина Зарина Кимовна",  "Кузнецова Чеслава Макаровна",  "Сафонова Виктория Геннадьевна",  "Захарова Дионисия Демьяновна",  "Савина Эдита Игоревна",  "Юдина Эльга Протасьевна",  "Иванкова Гера Ярославовна",  "Орлова Агата Протасьевна",  "Лаврентьева Розалия Германновна",  "Корнилова Томила Платоновна",  "Сергеева Кира Адольфовна",  "Лихачёва Августа Игоревна",  "Самойлова Анфиса Тарасовна",  "Кудряшова Верона Георгьевна",  "Давыдова Властилина Тихоновна",  "Белозёрова Евдокия Геласьевна",  "Кудрявцева Аида Денисовна",  "Ковалёва Эстелла Альбертовна",  "Чернова Эрика Семеновна",  "Филиппова Герда Алексеевна",  "Зуева Ирэн Дмитриевна",  "Бурова Видана Витальевна",  "Денисова Харита Семёновна",  "Молчанова Риана Станиславовна",  "Осипова Диодора Евгеньевна",  "Русакова Фия Юлиановна",  "Лобанова Мишель Улебовна",  "Муравьёва Анисья Фроловна",  "Хохлова Аида Лукьевна",  "Щербакова Кара Филатовна",  "Гурьева Нания Улебовна",  "Зиновьева Эвелина Петровна",  "Михеева Сандра Донатовна",  "Елисеева Иоанна Григорьевна",  "Емельянова Нинна Георгиевна",  "Королёва Есения Игоревна",  "Белякова Лира Христофоровна",  "Королёва Ася Григорьевна",  "Овчинникова Людмила Владимировна",  "Лебедева Санда Кимовна",  "Третьякова Борислава Альбертовна",  "Егорова Магда Владимировна",  "Аксёнова Клавдия Лукьевна",  "Лебедева Асида Авдеевна",  "Лаврентьева Цветана Пётровна",  "Кулакова Алевтина Дамировна",  "Красильникова Любава Федоровна",  "Кудряшова Екатерина Аркадьевна",  "Шарова Мартина Гордеевна",  "Смирнова Элла Евгеньевна",  "Антонова Амелия Протасьевна",  "Голубева Юфеза Николаевна",  "Васильева Мариша Богдановна",  "Денисова Белла Мироновна",  "Никонова Хильда Фроловна",  "Зимина Милда Георгьевна",  "Чернова Адельфина Эльдаровна",  "Власова Ивона Мартыновна",  "Кошелева Вероника Евгеньевна",  "Александрова Фая Игнатьевна",  "Пономарёва Аюна Яковлевна",  "Пестова Розалия Давидовна",  "Мишина Ксения Куприяновна",  "Денисова Прасковья Геннадиевна",  "Орлова Уля Константиновна",  "Родионова Янина Олеговна",  "Доронина Ксения Игоревна",  "Одинцова Оксана Никитевна",  "Калашникова Аюна Фроловна",  "Журавлёва Романа Ростиславовна",  "Шубина Аэлита Евгеньевна",  "Лазарева Мария Аристарховна",  "Осипова Эдуарда Натановна",  "Рябова Гелла Даниловна",  "Андреева Нелли Альвиановна",  "Дементьева Андриана Васильевна",  "Юдина Камилла Георгиевна",  "Карпова Евдокия Созоновна",  "Фомичёва Лилу Геласьевна",  "Алексеева Юлия Всеволодовна",  "Владимирова Эльвира Семеновна",  "Полякова Ирэна Агафоновна",  "Нестерова Милослава Матвеевна",  "Воронцова Валентина Данииловна",  "Авдеева Галина Сергеевна",  "Петрова Дарьяна Созоновна",  "Смирнова Янита Тимофеевна", "Николаев Гурий Парфеньевич", "Зыков Тарас Иосифович", "Степанов Роберт Рудольфович", "Комаров Ким Авксентьевич", "Калинин Феликс Эльдарович", "Громов Рудольф Матвеевич", "Пономарёв Любомир Васильевич", "Калинин Кондратий Тимофеевич", "Силин Вениамин Валентинович", "Быков Вилен Макарович", "Бобылёв Леонард Эдуардович", "Калинин Арнольд Николаевич", "Мухин Демьян Богуславович", "Григорьев Гордей Владимирович", "Русаков Болеслав Лукьянович", "Иванов Пантелей Геннадиевич", "Дементьев Бронислав Матвеевич", "Зимин Мечеслав Феликсович", "Голубев Мечеслав Платонович", "Веселов Юлиан Авксентьевич", "Соловьёв Ефим Гордеевич", "Кошелев Нелли Владимирович", "Зуев Юстин Семенович", "Кудряшов Гавриил Альбертович", "Рябов Рубен Денисович", "Максимов Клемент Агафонович", "Попов Самуил Мэлсович", "Горбунов Савелий Григорьевич", "Власов Юрий Филатович", "Селезнёв Адам Евсеевич", "Белозёров Кирилл Альвианович", "Потапов Геннадий Павлович", "Шилов Игорь Фролович", "Яковлев Любомир Матвеевич", "Фадеев Игнатий Михаилович", "Иванков Казимир Демьянович", "Сидоров Корней Владленович", "Кошелев Флор Андреевич", "Селиверстов Вальтер Григорьевич", "Котов Осип Протасьевич", "Васильев Аверьян Павлович", "Архипов Ипполит Проклович", "Васильев Панкратий Анатольевич", "Смирнов Клемент Романович", "Селиверстов Соломон Оскарович", "Гущин Мстислав Якунович", "Гущин Климент Семенович", "Куликов Севастьян Никитевич", "Михеев Терентий Алексеевич", "Евдокимов Денис Митрофанович", "Ларионов Харитон Натанович", "Ширяев Гордий Авдеевич", "Тарасов Власий Онисимович", "Иванков Аполлон Павлович", "Овчинников Юлий Платонович", "Герасимов Дмитрий Михаилович", "Цветков Максим Степанович", "Филатов Вилли Михайлович", "Виноградов Климент Валерьевич", "Медведев Кондрат Николаевич", "Мышкин Нинель Артёмович", "Сергеев Елисей Сергеевич", "Комиссаров Остап Ростиславович", "Горшков Василий Георгиевич", "Белоусов Гаянэ Давидович", "Уваров Мстислав Иринеевич", "Андреев Анатолий Евгеньевич", "Носков Афанасий Мэлорович", "Устинов Лаврентий Денисович", "Ефимов Исаак Улебович", "Бирюков Вячеслав Иванович", "Новиков Юстиниан Яковлевич", "Мишин Феликс Пётрович", "Юдин Валерий Русланович", "Комаров Любомир Геннадьевич", "Третьяков Мартин Онисимович", "Захаров Родион Германович", "Рыбаков Андрей Христофорович", "Воробьёв Панкратий Адольфович", "Жданов Лукьян Никитевич", "Лаврентьев Гаянэ Донатович", "Щербаков Иосиф Альвианович", "Кудрявцев Марк Парфеньевич", "Дмитриев Болеслав Валерьевич", "Карпов Май Рубенович", "Карпов Арнольд Максимович", "Дмитриев Михаил Мэлсович", "Пономарёв Клемент Рудольфович"]
publishers=["Владос","АСТ","URSS.ru","ГРАНД-ФАИР","Интеллект","ИНФРА-М","ОНИКС","Питер","КноРус","Академия","Айрис-пресс","АкадемическийПроект","ВесьМир","Вече","Высшаяшкола","Дрофа","КолосС","Лань","Омега-Л","Просвещение","Проспект","Профессия","Флинта","Эксмо","Академкнига","Вузовскаякнига"]

books=[]
with open("books", "r") as fin:
    books = list(set([s.strip() for s in fin if s.strip() != ""]))
    
def convert(val):
    if val is None:
        return "NULL"
    if (type(val) is str) or (type(val) is datetime.date):
        return f"'{val}'"
    return str(val)


def gen_row(row, seq):
    r = row if type(row) is list else [row]
    if seq:
        return f"(nextval('{seq}'), {', '.join(map(convert, r))})"
    else:
        return f"({', '.join(map(convert, r))})"
        

def gen_insert(header, data, seq = None):
    vals = ",\n".join([gen_row(r, seq) for r in data])
    return f"INSERT INTO {header} VALUES \n{vals};"

def gen_isbn():
    koeff = [1, 3, 1, 3, 1, 3, 1, 3, 1, 3, 1, 3, 1]
    digits = [9, 7, 8] + [random.randint(0, 9) for i in range(9)]
    last = 10 - sum(k * x for k, x in zip(koeff, digits)) % 10
    
    digits.append(last if last != 10 else 0)
    return "".join(map(str, digits))

def gen_phone():
    nums = "".join([str(random.randint(0, 9)) for i in range(10)])
    return f"+7{nums}"

def gen_email(n):
    surname = slugify(n.split()[0])
    host = random.choice(["mail.ru", "yandex.ru", "icloud.com", "google.com", "rambler.ru", "aol.com"])
    return f"{surname}@{host}"


def gen_id(count):
    return random.randint(0, count - 1) * 50 + 1

cnt_r = 100
cnt_a = 10
cnt_b = len(books)
cnt_p = len(publishers)

readers_table = [[n, gen_address(), gen_phone(), gen_email(n)] for n in random.choices(names, k=cnt_r)]
authors_table = random.choices(names, k=cnt_a)
publishers_table = publishers
total_books = [random.randint(1, 10) for i in range(cnt_b)]
books_table = [[
                gen_isbn(),
                b,
                gen_id(cnt_a),
                gen_id(cnt_p)]
                    for b in books]

book_instance_table = []
for t, b in zip(total_books, books_table):
    book_instance_table += [b[0]] * t
    
operation_table = []
for i, v in enumerate(book_instance_table):
    y = random.randint(2000, 2020)
    m = random.randint(1, 12)
    d = random.randint(1, 28)
    op_cnt = random.randint(0, 3)
    date = datetime.date(y, m, d)
    
    book_instance_id = i * 50 + 1
    
    two_weeks = datetime.timedelta(days = 14)
    
    for j in range(op_cnt):
        reader_id = gen_id(cnt_r)
        returned = datetime.timedelta(days = random.randint(1, 14))
        operation_table.append([book_instance_id,
                                reader_id,
                                date,
                                date + two_weeks,
                                date + returned])
        date += returned + datetime.timedelta(days = random.randint(1, 100))
    
    if random.random() > 0.8:
        reader_id = gen_id(cnt_r)
        operation_table.append([book_instance_id,
                                reader_id,
                                date,
                                date + two_weeks,
                                None])
    
    

print(gen_insert("reader(id, name, address, phone, email)", readers_table, "reader_seq"))
print(gen_insert("author(id, name)", authors_table, "author_seq"))
print(gen_insert("publisher(id, name)", publishers_table, "publisher_seq"))
print(gen_insert("book(isbn, title, author_id, publisher_id)", books_table))
print(gen_insert("book_instance(id, book_isbn)", book_instance_table, "book_instance_seq"))
print(gen_insert("operation(id, book_instance_id, reader_id, date, due_date, return_date)", operation_table, "operation_seq"))